INSERT INTO "public"."permission_list" ("feature_code", "name", "api_path", "is_enabled", "remark", "create_time", "update_time", "is_required") VALUES (100264, '此接口用來取得今日各時段輸贏(昨日&今日)', '/api/v1/manage/getintervaltotalscoredata', 't', '後台使用', '2022-12-07 02:45:38.847287+00', '2022-12-07 02:45:38.847287+00', 't');
INSERT INTO "public"."permission_list" ("feature_code", "name", "api_path", "is_enabled", "remark", "create_time", "update_time", "is_required") VALUES (100265, '此接口用來取得今日各時段、各遊戲投注人數(昨日&今日)', '/api/v1/manage/getintervaltotalbettorinfodata', 't', '後台使用', '2022-12-07 02:45:38.847287+00', '2022-12-07 02:45:38.847287+00', 't');


-- 可操作權限 account_type 開發者:1, 總代理:2, 子代理:3
UPDATE
  "public"."agent_permission"
SET
  "permission" = '{"list":[100200,100201,100202,100203,100204,100205,100206,100207,100208,100209,100210,100211,100212,100213,100214,100215,100225,100226,100227,100228,100229,100230,100231,100232,100233,100236,100237,100238,100239,100240,100241,100242,100245,100246,100247,100248,100249,100250,100251,100252,100255,100256,100257,100258,100259,100260,100261,100262,100263,100264,100265]}'
WHERE
  "account_type" = 1;

UPDATE
  "public"."agent_permission"
SET
  "permission" = '{"list":[100200,100201,100202,100203,100204,100205,100206,100207,100208,100209,100210,100211,100212,100213,100230,100231,100232,100233,100236,100237,100238,100239,100240,100241,100242,100245,100246,100247,100248,100249,100250,100251,100252,100253,100254,100255,100256,100257,100258,100259,100260,100261,100262,100263,100264,100265]}'
WHERE
  "account_type" = 2;

UPDATE
  "public"."agent_permission"
SET
  "permission" = '{"list":[100201,100202,100203,100204,100205,100206,100207,100208,100209,100210,100211,100212,100213,100230,100231,100232,100233,100236,100237,100238,100239,100240,100241,100242,100245,100246,100247,100248,100249,100252,100253,100254,100255,100256,100257,100258,100259,100260,100261,100262,100263,100264,100265]}'
WHERE
  "account_type" = 3;

UPDATE
  "public"."agent_permission"
SET
  "permission" = jsonb_set(
    "permission",
    '{list}',
    "permission" -> 'list' || '[100216]' :: jsonb,
    false
  )
WHERE
  "agent_id" = -1 AND "account_type" = 1;