INSERT INTO "public"."game" ("id", "server_info_code", "name", "code", "state", "h5_link", "type")
VALUES
  (1004, 'dev', '魚蝦蟹', 'prawncrab', 1, 'http://172.30.0.152/client/vue/', 1),
  (2001, 'dev', '21點', 'blackjack', 1, 'http://172.30.0.152/client/vue/', 2);

INSERT INTO "public"."game_room" ("id", "name", "state", "game_id", "room_type", "setting_info")
VALUES
  (5, '番攤新手房', 1, 1002, 0, '{"table_list":[100201]}'),
  (6, '番攤普通房', 1, 1002, 1, '{"table_list":[100211]}'),
  (7, '番攤高手房', 1, 1002, 2, '{"table_list":[100221]}'),
  (8, '番攤大師房', 1, 1002, 3, '{"table_list":[100231]}'),
  (9, '色碟新手房', 1, 1003, 0, '{"table_list":[100301]}'),
  (10, '色碟普通房', 1, 1003, 1, '{"table_list":[100311]}'),
  (11, '色碟高手房', 1, 1003, 2, '{"table_list":[100321]}'),
  (12, '色碟大師房', 1, 1003, 3, '{"table_list":[100331]}'),
  (13, '魚蝦蟹新手房', 1, 1004, 0, '{"table_list":[100401]}'),
  (14, '魚蝦蟹普通房', 1, 1004, 1, '{"table_list":[100411]}'),
  (15, '魚蝦蟹高手房', 1, 1004, 2, '{"table_list":[100421]}'),
  (16, '魚蝦蟹大師房', 1, 1004, 3, '{"table_list":[100431]}'),
  (17, '21點新手房', 1, 2001, 0, '{"table_list":[200101]}'),
  (18, '21點普通房', 1, 2001, 1, '{"table_list":[200111]}'),
  (19, '21點高手房', 1, 2001, 2, '{"table_list":[200121]}'),
  (20, '21點大師房', 1, 2001, 3, '{"table_list":[200131]}');
